<?php
/*3. Реализовать основные 4 арифметические операции
в виде функций с двумя параметрами.
Обязательно использовать оператор return.
В делении проверьте деление на 0 и верните текст ошибки.*/

include("task_3_function.php");

$a = rand(-100, 100);
$b = rand(-100, 100);

echo "</br>Сложение {$a} + {$b} = " . addition($a, $b);
echo "</br>Вычитание {$a} - {$b} = " . subtraction($a, $b);
echo "</br>Умножение {$a} * {$b} = " . multiplication($a, $b);
echo "</br>Деление {$a} / {$b} = " . division($a, $b);
echo "</br>Деление {$a} / {$b} = " . division($a, 0);