<?php
/*3. Объявить массив, в котором в качестве ключей будут использоваться названия областей,
а в качестве значений – массивы с названиями городов из соответствующей области.
Вывести в цикле значения массива, чтобы результат был таким:
Московская область:
Москва, Зеленоград, Клин.
Ленинградская область:
Санкт-Петербург, Всеволожск, Павловск, Кронштадт.
Рязанская область … (названия городов можно найти на maps.yandex.ru)
строго соблюдать формат вывода выше, т.е. двоеточие и точка в конце*/

$regions = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязанская область" => ["Рязань", "михайлов", "Скопин", "Шилово", "Касимов"]
];

function itemInRegions($regions)
{
    $result = "";
    foreach ($regions as $region => $item) {
        $result .= "<strong>" . $region . ":</strong><br>" . cityInRegion($item) . "<br>";
    }

    return $result;
}

function cityInRegion($region)
{
    $result = "";
    foreach ($region as $item) {
        $result .= $item . ", ";
    }

    return rtrim($result, ", ") . ".";
}

echo itemInRegions($regions);